#include "radarengine.h"

#include <math.h>
#include <unistd.h>

RadarState state_radar = RADAR_OFF;
ReportFilter filter;
ReportAlign align;
ReportScanSignal scanSignal;
RadarSettings radar_settings;
ARPASettings arpa_settings;
GZSettings gz_settings;
TrailSettings trail_settings;
ADSBSettings adsb_settings;

double currentOwnShipLat;
double currentOwnShipLon;
double radarHeading;
double currentHeading;
bool headingUp;
bool gps_auto;
bool hdg_auto;

bool enable_mti;
int mti_value;

P2CLookupTable *lookupTable = 0;
P2CLookupTable* GetP2CLookupTable()
{
    if (!lookupTable)
    {
        lookupTable = (P2CLookupTable*)malloc(sizeof(P2CLookupTable));

        if (!lookupTable)
        {
            qDebug()<<Q_FUNC_INFO<<"Out Of Memory, fatal!";
            exit(1);
        }

        for (int arc = 0; arc < LINES_PER_ROTATION + 1; arc++)
        {
            GLfloat sine = cosf((GLfloat)arc * PI * 2 / LINES_PER_ROTATION);
            GLfloat cosine = sinf((GLfloat)arc * PI * 2 / LINES_PER_ROTATION);
            for (int radius = 0; radius < RETURNS_PER_LINE + 1; radius++)
            {
                lookupTable->x[arc][radius] = (GLfloat)radius * cosine/RETURNS_PER_LINE;
                lookupTable->y[arc][radius] = (GLfloat)radius * sine/RETURNS_PER_LINE;
//                qDebug()<<Q_FUNC_INFO<<"x "<<lookupTable->x[arc][radius]<<"y "<<lookupTable->y[arc][radius];
            }
        }
    }
    return lookupTable;
}



  // As V is the identity matrix, it is left out of the calculation of the Kalman gain

  // P estimate error covariance
  // initial values follow
  // P(1, 1) = .0000027 * range * range;   ???
  P = ZeroMatrix4;
  P(0, 0) = 20.;
  P(1, 1) = P(1, 1);
  P(2, 2) = 4.;
  P(3, 3) = 4.;

  // Q Process noise covariance matrix
  Q(0, 0) = NOISE;  // variance in lat speed, (m / sec)2
  Q(1, 1) = NOISE;  // variance in lon speed, (m / sec)2

  // R measurement noise covariance matrix
  R(0, 0) = 100.0;  // variance in the angle 3.0
  R(1, 1) = 25.;    // variance in radius  .5
}

void KalmanFilter::Predict(LocalPosition* xx, double delta_time) {
  Matrix<double, 4, 1> X;
  X(0, 0) = xx->lat;
  X(1, 0) = xx->lon;
  X(2, 0) = xx->dlat_dt;
  X(3, 0) = xx->dlon_dt;
  A(0, 2) = delta_time;  // time in seconds
  A(1, 3) = delta_time;
  /*
  qDebug()<<Q_FUNC_INFO<<"xx lat"<<X(0, 0)<<"xx lon"<<X(1, 0)
         <<"ddlat "<<X(2, 0)<<"dlon"<<X(3, 0)
        <<"A(0, 0)"<<A(0, 0)<<"A(0, 1)"<<A(0, 1)<<"A(0, 2)"<<A(0, 2)
          <<"A(0, 3)"<<A(0, 3);
  */

  AT(2, 0) = delta_time;
  AT(3, 1) = delta_time;

  X = A * X;
  xx->lat = X(0, 0);
  xx->lon = X(1, 0);
  xx->dlat_dt = X(2, 0);
  xx->dlon_dt = X(3, 0);
  xx->sd_speed_m_s = sqrt((P(2, 2) + P(3, 3)) / 2.);
  return;
}

void KalmanFilter::Update_P() {
  // calculate apriori P
  // separated from the predict to prevent the update being done both in pass 1 and pass2

  P = A * P * AT + W * Q * WT;
  return;
}
void KalmanFilter::SetMeasurement(Polar* pol, LocalPosition* x, Polar* expected, int range) {
// pol measured angular position
// x expected local position
// expected, same but in polar coordinates
#define SQUARED(x) ((x) * (x))
  double q_sum = SQUARED(x->lon) + SQUARED(x->lat);

  double c = 2048. / (2. * PI);
  H(0, 0) = -c * x->lon / q_sum;
  H(0, 1) = c * x->lat / q_sum;

  q_sum = sqrt(q_sum);
  H(1, 0) = x->lat / q_sum * 512. / (double)range;
  H(1, 1) = x->lon / q_sum * 512. / (double)range;

  HT = H.Transpose();

  Matrix<double, 2, 1> Z;
  Z(0, 0) = (double)(pol->angle - expected->angle);  // Z is  difference between measured and expected
  if (Z(0, 0) > LINES_PER_ROTATION / 2) {
    Z(0, 0) -= LINES_PER_ROTATION;
  }
  if (Z(0, 0) < -LINES_PER_ROTATION / 2) {
    Z(0, 0) += LINES_PER_ROTATION;
  }
  Z(1, 0) = (double)(pol->r - expected->r);

  Matrix<double, 4, 1> X;
  X(0, 0) = x->lat;
  X(1, 0) = x->lon;
  X(2, 0) = x->dlat_dt;
  X(3, 0) = x->dlon_dt;

  // calculate Kalman gain
  K = P * HT * ((H * P * HT + R).Inverse());

  // calculate apostriori expected position
  X = X + K * Z;
  x->lat = X(0, 0);
  x->lon = X(1, 0);
  x->dlat_dt = X(2, 0);
  x->dlon_dt = X(3, 0);

  // update covariance P
  P = (I - K * H) * P;
  x->sd_speed_m_s = sqrt((P(2, 2) + P(3, 3)) / 2.);  // rough approximation of standard dev of speed
  return;
}




/*****************************receive data class*********************************/
#define HEADING_TRUE_FLAG 0x4000
#define HEADING_MASK (SPOKES - 1)
#define HEADING_VALID(x) (((x) & ~(HEADING_TRUE_FLAG | HEADING_MASK)) == 0)

struct RadarReport_01C4_18
{  // 01 C4 with length 18
    UINT8 what;                 // 0   0x01
    UINT8 command;              // 1   0xC4
    UINT8 radar_status;         // 2
    UINT8 field3;               // 3
    UINT8 field4;               // 4
    UINT8 field5;               // 5
    UINT16 field6;              // 6-7
    UINT16 field8;              // 8-9
    UINT16 field10;             // 10-11
};
struct RadarReport_02C4_99
{     // length 99
    UINT8 what;                    // 0   0x02
    UINT8 command;                 // 1 0xC4
    UINT32 range;                  //  2-3   0x06 0x09
    UINT16 field4;                 // 6-7    0
    UINT32 field8;                 // 8-11   1
    UINT8 gain;                    // 12
    UINT8 field13;                 // 13  ==1 for sea auto
    UINT8 field14;                 // 14
    UINT16 field15;                // 15-16
    UINT32 sea;                    // 17-20   sea state (17)
    UINT8 field21;                 // 21
    UINT8 rain;                    // 22   rain clutter
    UINT8 field23;                 // 23
    UINT32 field24;                // 24-27
    UINT32 field28;                // 28-31
    UINT8 field32;                 // 32
    UINT8 field33;                 // 33
    UINT8 interference_rejection;  // 34
    UINT8 field35;                 // 35
    UINT8 field36;                 // 36
    UINT8 field37;                 // 37
    UINT8 target_expansion;        // 38
    UINT8 field39;                 // 39
    UINT8 field40;                 // 40
    UINT8 field41;                 // 41
    UINT8 target_boost;            // 42
};

struct RadarReport_03C4_129
{
    UINT8 what;
    UINT8 command;
    UINT8 radar_type;  //01 = 4G, 08 = 3G, 0F = BR24
    UINT8 u00[55];     // Lots of unknown
    UINT16 firmware_date[16];
    UINT16 firmware_time[16];
    UINT8 u01[7];
};

struct RadarReport_04C4_66
{  // 04 C4 with length 66
    UINT8 what;                 // 0   0x04
    UINT8 command;              // 1   0xC4
    UINT32 field2;              // 2-5
    UINT16 bearing_alignment;   // 6-7
    UINT16 field8;              // 8-9
    UINT16 antenna_height;      // 10-11
};

struct RadarReport_08C4_18
{           // 08 c4  length 18
    UINT8 what;                          // 0  0x08
    UINT8 command;                       // 1  0xC4
    UINT8 field2;                        // 2
    UINT8 local_interference_rejection;  // 3
    UINT8 scan_speed;                    // 4
    UINT8 sls_auto;                      // 5
    UINT8 field6;                        // 6
    UINT8 field7;                        // 7
    UINT8 field8;                        // 8
    UINT8 side_lobe_suppression;         // 9
    UINT16 field10;                      // 10-11
    UINT8 noise_rejection;               // 12    noise rejection
    UINT8 target_sep;                    // 13
};

struct common_header
{
    UINT8 headerLen;       // 1 bytes
    UINT8 status;          // 1 bytes
    UINT8 scan_number[2];  // 2 bytes, 0-4095
    UINT8 u00[4];          // 4 bytes
    UINT8 angle[2];        // 2 bytes
    UINT8 heading[2];      // 2 bytes heading with RI-10/11. See bitmask explanation above.
};

struct br4g_header
{
    UINT8 headerLen;       // 1 bytes
    UINT8 status;          // 1 bytes
    UINT8 scan_number[2];  // 2 bytes, 0-4095
    UINT8 u00[2];          // Always 0x4400 (integer)
    UINT8 largerange[2];   // 2 bytes or -1
    UINT8 angle[2];        // 2 bytes
    UINT8 heading[2];      // 2 bytes heading with RI-10/11 or -1. See bitmask explanation above.
    UINT8 smallrange[2];   // 2 bytes or -1
    UINT8 rotation[2];     // 2 bytes, rotation/angle
    UINT8 u02[4];          // 4 bytes signed integer, always -1
